Revit.Elements.Level
A Revit Level

Revit.Elements.Level.#ctor(System.Double,System.String)
Private constructor for Level
elevation:
name:

Revit.Elements.Level.#ctor(Autodesk.Revit.DB.Level)
Private constructor for Level
level:

Revit.Elements.Level.InitLevel(System.Double,System.String)
Initialize a Level element
elevation:
name:

Revit.Elements.Level.InternalSetLevel(Autodesk.Revit.DB.Level)
Set the Element, it's Id, and it's uniqueId
level:

Revit.Elements.Level.InternalSetElevation(System.Double)
Mutate the height of the level
elevation:

Revit.Elements.Level.InternalSetName(System.String)
Mutate the name of the level
name:

Revit.Elements.Level.ByElevationAndName(System.Double,System.String)
Create a Revit Level given it's elevation and name in the project
elevation:
name:
Returns:

Revit.Elements.Level.ByElevation(System.Double)
Create a Revit Level given it's elevation.  The name will be whatever
Revit gives it.
elevation:
Returns:

Revit.Elements.Level.ByLevelAndOffset(Revit.Elements.Level,System.Double)
Create a Revit Level given it's length offset from an existing level
level:
offset:
Returns:

Revit.Elements.Level.ByLevelOffsetAndName(Revit.Elements.Level,System.Double,System.String)
Create a Revit Level given a distance offset from an existing
level and a name for the new level
level:
offset:
name:
Returns:

Revit.Elements.Level.FromExisting(Autodesk.Revit.DB.Level,System.Boolean)
Create a Level from a user selected Element.
level:
isRevitOwned:
Returns:

Revit.Elements.Level.InternalLevel
Internal reference to Revit element

Revit.Elements.Level.InternalElement
Reference to the Element

Revit.Elements.Level.Elevation
The elevation of the level above ground level

Revit.Elements.Level.ProjectElevation
Elevation relative to the Project origin

Revit.Elements.Level.Name
The name of the level